#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fer1035/aws01/runs/run-RjKSpWhqZ5rfMv4N

Waiting for the plan to start...

Terraform v1.0.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.modules.aws_lambda_function.function: Refreshing state... [id=tf_lambda]
aws_api_gateway_api_key.api_key: Refreshing state... [id=hl8qdf19r8]
aws_api_gateway_stage.stage: Refreshing state... [id=ags-owmqqom9cd-test]
aws_api_gateway_usage_plan.usage_plan: Refreshing state... [id=6yqfdm]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_resource.resource: Refreshing state... [id=n1yi0g]
aws_api_gateway_method.method: Refreshing state... [id=agm-owmqqom9cd-n1yi0g-POST]
aws_api_gateway_method_settings.all: Refreshing state... [id=owmqqom9cd-test-*/*]
aws_api_gateway_request_validator.validator: Refreshing state... [id=2qyyd4]
module.modules.aws_iam_role.iam_for_lambda: Refreshing state... [id=tf_lambda_role]
aws_wafv2_web_acl_association.waf_association: Refreshing state... [id=arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL_Regional/afa108d2-484e-471c-9c2b-daf87d5e74f5,arn:aws:apigateway:us-east-1::/restapis/owmqqom9cd/stages/test]
aws_api_gateway_deployment.deployment: Refreshing state... [id=0e2y70]
aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-owmqqom9cd-n1yi0g-POST-200]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-owmqqom9cd-n1yi0g-POST]
aws_api_gateway_rest_api.api: Refreshing state... [id=owmqqom9cd]
aws_api_gateway_usage_plan_key.plan_key: Refreshing state... [id=hl8qdf19r8]
aws_api_gateway_model.model: Refreshing state... [id=a47sga]
module.modules.aws_wafv2_web_acl.waf_regional: Refreshing state... [id=afa108d2-484e-471c-9c2b-daf87d5e74f5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_api_gateway_api_key.api_key will be destroyed
  - resource "aws_api_gateway_api_key" "api_key" {
      - arn               = "arn:aws:apigateway:us-east-1::/apikeys/hl8qdf19r8" -> null
      - created_date      = "2021-10-06T05:49:03Z" -> null
      - description       = "Managed by Terraform" -> null
      - enabled           = true -> null
      - id                = "hl8qdf19r8" -> null
      - last_updated_date = "2021-10-06T05:49:03Z" -> null
      - name              = "my_api_key" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
      - value             = (sensitive value)
    }

  # aws_api_gateway_deployment.deployment will be destroyed
  - resource "aws_api_gateway_deployment" "deployment" {
      - created_date  = "2021-10-06T06:14:22Z" -> null
      - execution_arn = "arn:aws:execute-api:us-east-1:531133914787:owmqqom9cd/" -> null
      - id            = "0e2y70" -> null
      - invoke_url    = "https://owmqqom9cd.execute-api.us-east-1.amazonaws.com/" -> null
      - rest_api_id   = "owmqqom9cd" -> null
      - triggers      = {
          - "redeployment" = "ae8e5dcdd1caf920add9843de63757bd87bb8d96"
        } -> null
    }

  # aws_api_gateway_integration.integration will be destroyed
  - resource "aws_api_gateway_integration" "integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "n1yi0g" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "POST" -> null
      - id                      = "agi-owmqqom9cd-n1yi0g-POST" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "n1yi0g" -> null
      - rest_api_id             = "owmqqom9cd" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:531133914787:function:tf_lambda/invocations" -> null
    }

  # aws_api_gateway_method.method will be destroyed
  - resource "aws_api_gateway_method" "method" {
      - api_key_required     = true -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "POST" -> null
      - id                   = "agm-owmqqom9cd-n1yi0g-POST" -> null
      - request_models       = {
          - "application/json" = "UserModel"
        } -> null
      - request_parameters   = {
          - "method.request.header.content-type" = true
          - "method.request.header.x-api-key"    = true
          - "method.request.querystring.code"    = true
        } -> null
      - request_validator_id = "2qyyd4" -> null
      - resource_id          = "n1yi0g" -> null
      - rest_api_id          = "owmqqom9cd" -> null
    }

  # aws_api_gateway_method_response.response_200 will be destroyed
  - resource "aws_api_gateway_method_response" "response_200" {
      - http_method         = "POST" -> null
      - id                  = "agmr-owmqqom9cd-n1yi0g-POST-200" -> null
      - resource_id         = "n1yi0g" -> null
      - response_models     = {} -> null
      - response_parameters = {} -> null
      - rest_api_id         = "owmqqom9cd" -> null
      - status_code         = "200" -> null
    }

  # aws_api_gateway_method_settings.all will be destroyed
  - resource "aws_api_gateway_method_settings" "all" {
      - id          = "owmqqom9cd-test-*/*" -> null
      - method_path = "*/*" -> null
      - rest_api_id = "owmqqom9cd" -> null
      - stage_name  = "test" -> null

      - settings {
          - cache_data_encrypted                       = false -> null
          - cache_ttl_in_seconds                       = 300 -> null
          - caching_enabled                            = false -> null
          - data_trace_enabled                         = false -> null
          - logging_level                              = "OFF" -> null
          - metrics_enabled                            = false -> null
          - require_authorization_for_cache_control    = true -> null
          - throttling_burst_limit                     = 500 -> null
          - throttling_rate_limit                      = 1000 -> null
          - unauthorized_cache_control_header_strategy = "SUCCEED_WITH_RESPONSE_HEADER" -> null
        }
    }

  # aws_api_gateway_model.model will be destroyed
  - resource "aws_api_gateway_model" "model" {
      - content_type = "application/json" -> null
      - description  = "Request schema model." -> null
      - id           = "a47sga" -> null
      - name         = "UserModel" -> null
      - rest_api_id  = "owmqqom9cd" -> null
      - schema       = jsonencode(
            {
              - $schema              = "http://json-schema.org/draft-04/schema#"
              - additionalProperties = false
              - properties           = {
                  - myname = {
                      - type = "string"
                    }
                }
              - required             = [
                  - "myname",
                ]
              - title                = "UserModel"
              - type                 = "object"
            }
        ) -> null
    }

  # aws_api_gateway_request_validator.validator will be destroyed
  - resource "aws_api_gateway_request_validator" "validator" {
      - id                          = "2qyyd4" -> null
      - name                        = "validator" -> null
      - rest_api_id                 = "owmqqom9cd" -> null
      - validate_request_body       = true -> null
      - validate_request_parameters = true -> null
    }

  # aws_api_gateway_resource.resource will be destroyed
  - resource "aws_api_gateway_resource" "resource" {
      - id          = "n1yi0g" -> null
      - parent_id   = "1nn1xfuiaa" -> null
      - path        = "/event" -> null
      - path_part   = "event" -> null
      - rest_api_id = "owmqqom9cd" -> null
    }

  # aws_api_gateway_rest_api.api will be destroyed
  - resource "aws_api_gateway_rest_api" "api" {
      - api_key_source               = "HEADER" -> null
      - arn                          = "arn:aws:apigateway:us-east-1::/restapis/owmqqom9cd" -> null
      - binary_media_types           = [] -> null
      - created_date                 = "2021-10-06T05:49:03Z" -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:us-east-1:531133914787:owmqqom9cd" -> null
      - id                           = "owmqqom9cd" -> null
      - minimum_compression_size     = -1 -> null
      - name                         = "myapi" -> null
      - root_resource_id             = "1nn1xfuiaa" -> null
      - tags                         = {} -> null
      - tags_all                     = {} -> null

      - endpoint_configuration {
          - types            = [
              - "EDGE",
            ] -> null
          - vpc_endpoint_ids = [] -> null
        }
    }

  # aws_api_gateway_stage.stage will be destroyed
  - resource "aws_api_gateway_stage" "stage" {
      - arn                   = "arn:aws:apigateway:us-east-1::/restapis/owmqqom9cd/stages/test" -> null
      - cache_cluster_enabled = false -> null
      - deployment_id         = "0e2y70" -> null
      - execution_arn         = "arn:aws:execute-api:us-east-1:531133914787:owmqqom9cd/test" -> null
      - id                    = "ags-owmqqom9cd-test" -> null
      - invoke_url            = "https://owmqqom9cd.execute-api.us-east-1.amazonaws.com/test" -> null
      - rest_api_id           = "owmqqom9cd" -> null
      - stage_name            = "test" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - variables             = {} -> null
      - xray_tracing_enabled  = false -> null
    }

  # aws_api_gateway_usage_plan.usage_plan will be destroyed
  - resource "aws_api_gateway_usage_plan" "usage_plan" {
      - arn         = "arn:aws:apigateway:us-east-1::/usageplans/6yqfdm" -> null
      - description = "API usage plan." -> null
      - id          = "6yqfdm" -> null
      - name        = "my_usage_plan" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null

      - api_stages {
          - api_id = "owmqqom9cd" -> null
          - stage  = "test" -> null
        }

      - quota_settings {
          - limit  = 10000 -> null
          - offset = 0 -> null
          - period = "MONTH" -> null
        }

      - throttle_settings {
          - burst_limit = 500 -> null
          - rate_limit  = 1000 -> null
        }
    }

  # aws_api_gateway_usage_plan_key.plan_key will be destroyed
  - resource "aws_api_gateway_usage_plan_key" "plan_key" {
      - id            = "hl8qdf19r8" -> null
      - key_id        = "hl8qdf19r8" -> null
      - key_type      = "API_KEY" -> null
      - name          = "my_api_key" -> null
      - usage_plan_id = "6yqfdm" -> null
      - value         = "It2AZawgKP9Jc0EjiwScH1NEkoTBBtSI1MUdHvRx" -> null
    }

  # aws_lambda_permission.apigw_lambda will be destroyed
  - resource "aws_lambda_permission" "apigw_lambda" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "tf_lambda" -> null
      - id            = "AllowExecutionFromAPIGateway" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - source_arn    = "arn:aws:execute-api:us-east-1:531133914787:owmqqom9cd/*/POST/event" -> null
      - statement_id  = "AllowExecutionFromAPIGateway" -> null
    }

  # aws_wafv2_web_acl_association.waf_association will be destroyed
  - resource "aws_wafv2_web_acl_association" "waf_association" {
      - id           = "arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL_Regional/afa108d2-484e-471c-9c2b-daf87d5e74f5,arn:aws:apigateway:us-east-1::/restapis/owmqqom9cd/stages/test" -> null
      - resource_arn = "arn:aws:apigateway:us-east-1::/restapis/owmqqom9cd/stages/test" -> null
      - web_acl_arn  = "arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL_Regional/afa108d2-484e-471c-9c2b-daf87d5e74f5" -> null
    }

  # module.modules.aws_iam_role.iam_for_lambda will be destroyed
  - resource "aws_iam_role" "iam_for_lambda" {
      - arn                   = "arn:aws:iam::531133914787:role/tf_lambda_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-10-07T03:16:28Z" -> null
      - force_detach_policies = false -> null
      - id                    = "tf_lambda_role" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "tf_lambda_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAXXKQML2RSQPFSOXXI" -> null

      - inline_policy {}
    }

  # module.modules.aws_lambda_function.function will be destroyed
  - resource "aws_lambda_function" "function" {
      - architectures                  = [
          - "arm64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:531133914787:function:tf_lambda" -> null
      - filename                       = "resources/lambda_function.zip" -> null
      - function_name                  = "tf_lambda" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "tf_lambda" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:531133914787:function:tf_lambda/invocations" -> null
      - last_modified                  = "2021-10-07T06:35:06.950+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:531133914787:function:tf_lambda:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::531133914787:role/tf_lambda_role" -> null
      - runtime                        = "python3.9" -> null
      - source_code_hash               = "C0F9J2EXongFV5TeQKnhVgMybnu+oFIyDUJtU7yTHgM=" -> null
      - source_code_size               = 690 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "CORS"     = "*"
              - "ENCODING" = "latin-1"
            } -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.modules.aws_wafv2_web_acl.waf_regional will be destroyed
  - resource "aws_wafv2_web_acl" "waf_regional" {
      - arn         = "arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL_Regional/afa108d2-484e-471c-9c2b-daf87d5e74f5" -> null
      - capacity    = 925 -> null
      - description = "Standard WebACL for API Gateway, TerraForm deploy." -> null
      - id          = "afa108d2-484e-471c-9c2b-daf87d5e74f5" -> null
      - lock_token  = "1bd03b06-5199-4723-bfe7-34036a7bbe40" -> null
      - name        = "StandardACL_Regional" -> null
      - scope       = "REGIONAL" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null

      - default_action {
          - allow {
            }
        }

      - rule {
          - name     = "AWSManagedRulesAmazonIpReputation" -> null
          - priority = 2 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = false -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputation" -> null
              - sampled_requests_enabled   = false -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesCommonRule" -> null
          - priority = 0 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesCommonRuleSet" -> null
                  - vendor_name = "AWS" -> null

                  - excluded_rule {
                      - name = "GenericRFI_QUERYARGUMENTS" -> null
                    }
                  - excluded_rule {
                      - name = "GenericRFI_BODY" -> null
                    }
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = false -> null
              - metric_name                = "AWSManagedRulesCommonRule" -> null
              - sampled_requests_enabled   = false -> null
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRule" -> null
          - priority = 1 -> null

          - override_action {

              - none {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = false -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRule" -> null
              - sampled_requests_enabled   = false -> null
            }
        }

      - visibility_config {
          - cloudwatch_metrics_enabled = false -> null
          - metric_name                = "StandardACL" -> null
          - sampled_requests_enabled   = false -> null
        }
    }

  # module.security_demo.aws_api_gateway_api_key.api_key will be created
  + resource "aws_api_gateway_api_key" "api_key" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "Managed by Terraform"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "my_api_key"
      + tags_all          = (known after apply)
      + value             = (sensitive value)
    }

  # module.security_demo.aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # module.security_demo.aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.security_demo.aws_api_gateway_method.method will be created
  + resource "aws_api_gateway_method" "method" {
      + api_key_required     = true
      + authorization        = "NONE"
      + http_method          = "POST"
      + id                   = (known after apply)
      + request_models       = {
          + "application/json" = "UserModel"
        }
      + request_parameters   = {
          + "method.request.header.content-type" = true
          + "method.request.header.x-api-key"    = true
          + "method.request.querystring.code"    = true
        }
      + request_validator_id = (known after apply)
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
    }

  # module.security_demo.aws_api_gateway_method_response.response_200 will be created
  + resource "aws_api_gateway_method_response" "response_200" {
      + http_method = "POST"
      + id          = (known after apply)
      + resource_id = (known after apply)
      + rest_api_id = (known after apply)
      + status_code = "200"
    }

  # module.security_demo.aws_api_gateway_method_settings.all will be created
  + resource "aws_api_gateway_method_settings" "all" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "test"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = "OFF"
          + metrics_enabled                            = false
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = 500
          + throttling_rate_limit                      = 1000
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.security_demo.aws_api_gateway_model.model will be created
  + resource "aws_api_gateway_model" "model" {
      + content_type = "application/json"
      + description  = "Request schema model."
      + id           = (known after apply)
      + name         = "UserModel"
      + rest_api_id  = (known after apply)
      + schema       = jsonencode(
            {
              + $schema              = "http://json-schema.org/draft-04/schema#"
              + additionalProperties = false
              + properties           = {
                  + myname = {
                      + type = "string"
                    }
                }
              + required             = [
                  + "myname",
                ]
              + title                = "UserModel"
              + type                 = "object"
            }
        )
    }

  # module.security_demo.aws_api_gateway_request_validator.validator will be created
  + resource "aws_api_gateway_request_validator" "validator" {
      + id                          = (known after apply)
      + name                        = "validator"
      + rest_api_id                 = (known after apply)
      + validate_request_body       = true
      + validate_request_parameters = true
    }

  # module.security_demo.aws_api_gateway_resource.resource will be created
  + resource "aws_api_gateway_resource" "resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "event"
      + rest_api_id = (known after apply)
    }

  # module.security_demo.aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "myapi"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.security_demo.aws_api_gateway_stage.stage will be created
  + resource "aws_api_gateway_stage" "stage" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "test"
      + tags_all      = (known after apply)
    }

  # module.security_demo.aws_api_gateway_usage_plan.usage_plan will be created
  + resource "aws_api_gateway_usage_plan" "usage_plan" {
      + arn         = (known after apply)
      + description = "API usage plan."
      + id          = (known after apply)
      + name        = "my_usage_plan"
      + tags_all    = (known after apply)

      + api_stages {
          + api_id = (known after apply)
          + stage  = "test"
        }

      + quota_settings {
          + limit  = 10000
          + offset = 0
          + period = "MONTH"
        }

      + throttle_settings {
          + burst_limit = 500
          + rate_limit  = 1000
        }
    }

  # module.security_demo.aws_api_gateway_usage_plan_key.plan_key will be created
  + resource "aws_api_gateway_usage_plan_key" "plan_key" {
      + id            = (known after apply)
      + key_id        = (known after apply)
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # module.security_demo.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tf_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.security_demo.aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + filename                       = "./modules/security_demo/resources/lambda_function.zip"
      + function_name                  = "tf_lambda"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "sAi8qs1XMbNuAnK8+D3Z4iO95JUiFod/4pMsQQWqffU="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CORS"     = "*"
              + "ENCODING" = "latin-1"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.security_demo.aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "tf_lambda"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # module.security_demo.aws_wafv2_web_acl.waf_regional will be created
  + resource "aws_wafv2_web_acl" "waf_regional" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "Standard WebACL for API Gateway, TerraForm deploy."
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "StandardACL_Regional"
      + scope       = "REGIONAL"
      + tags_all    = (known after apply)

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "AWSManagedRulesAmazonIpReputation"
          + priority = 2

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesAmazonIpReputation"
              + sampled_requests_enabled   = false
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRule"
          + priority = 0

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesCommonRule"
              + sampled_requests_enabled   = false
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRule"
          + priority = 1

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = false
              + metric_name                = "AWSManagedRulesKnownBadInputsRule"
              + sampled_requests_enabled   = false
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = false
          + metric_name                = "StandardACL"
          + sampled_requests_enabled   = false
        }
    }

  # module.security_demo.aws_wafv2_web_acl_association.waf_association will be created
  + resource "aws_wafv2_web_acl_association" "waf_association" {
      + id           = (known after apply)
      + resource_arn = (known after apply)
      + web_acl_arn  = (known after apply)
    }

Plan: 18 to add, 0 to change, 18 to destroy.

Changes to Outputs:
  - API_Endpoint = "https://owmqqom9cd.execute-api.us-east-1.amazonaws.com/test/event" -> null
  + api_endpoint = (known after apply)

```

</details>

*Pusher: @fer1035, Action: `pull_request`*